<a href="https://colab.research.google.com/github/crqcastro/undb_datamining/blob/master/Aula20210804.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
#imports
import pandas as pd

In [6]:
df = pd.read_excel("titanic3.xls")

In [12]:
df.head(10)

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
5       1         1  ...    NaN                     New York, NY
6       1         1  ...    NaN                       Hudson, NY
7       1         0  ...    NaN                      Belfast, NI
8       1         1  ...    NaN              Bayside, Queens, NY
9       1         0  ...   22.0              Montevideo, Uruguay

[10 rows x 14 columns]

In [16]:
df.shape

(1309, 14)

In [19]:
df.describe

<bound method NDFrame.describe of       pclass  survived  ...   body                        home.dest
0          1         1  ...    NaN                     St Louis, MO
1          1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3          1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1304       3         0  ...  328.0                              NaN
1305       3         0  ...    NaN                              NaN
1306       3         0  ...  304.0                              NaN
1307       3         0  ...    NaN                              NaN
1308       3         0  ...    NaN                              NaN

[1309 rows x 14 columns]>

In [22]:
df.age.mean()

29.8811345124283

In [24]:
df.age.median()

28.0

In [31]:
#female = 0
#male = 1
df.sex = df.sex.replace('female', 0)
df.sex = df.sex.replace('male', 1)

In [32]:
df.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]